[Language]
Main_Title=Köszönjük a választását EaseUS Data Recovery Wizard
Sub_Title=Hogyan értékelné átfogó tapasztalatát?
Terrible=Szörnyű
Poor=Szegény
Good=Jó
Great=Nagy
Excellent=Kiváló
Never_Ask_Again=Soha ne kérdezd újra
Rate_Now=Értékeld most
Feedback_Text_Tips=Kérjük hagyja itt visszajelzését.
Feedback_Length_Tips=Beírt több mint 500 levelet. Kérjük írjon több visszajelzést a support@easeus.com.